app/controllers/calendars_controller.rb

SELECT "meal_tickets".* FROM "meal_tickets" WHERE "meal_tickets"."user_id" = 5 AND (EXTRACT(MONTH FROM date) = 3 AND EXTRACT(YEAR FROM date) = 2026) ORDER BY "meal_tickets"."date" ASC
---
  def show
    @user = current_user
    @month = (params[:month].to_i > 0) ? params[:month].to_i : Date.today.month
    @year = (params[:year].to_i > 0) ? params[:year].to_i : Date.today.year

    @tickets = @user.meal_tickets_for_month(@month, @year)
    @tickets_by_date = @tickets.index_by(&:date)

    @calendar_days = build_calendar_days

    @today_details = @user.meal_details.find_by(date: Date.today)