app/controllers/registrations_controller.rb

  def create
    @user = User.new(user_params.except(:giae_username, :giae_password))
    @child = @user.children.build(
      giae_username: params[:user]&.dig(:giae_username),
      giae_password: params[:user]&.dig(:giae_password)
    )

    ActiveRecord::Base.transaction do
      @user.save!
---
INSERT INTO "users" ("created_at", "email", "email_notifications_enabled", "giae_password", "giae_password_ciphertext", "giae_username", "giae_username_ciphertext", "in_app_notifications_enabled", "last_refreshed_at", "password_digest", "updated_at") VALUES ('2026-03-03 12:22:09.695312', 'tiago.nobre@protonmail.com', TRUE, '{"p":"oy/vXNCjEeNqab7wcZQVEW3J4/A=","h":{"iv":"Qzimi9+4RXFeDIqD","at":"JDtCJLuGLcnmG/GeDpgzDw=="}}', NULL, '{"p":"G5ssqjbLYQ==","h":{"iv":"ITULAoDZuzG9g1VY","at":"+YKlKPMEKmSvDkwva1ciSQ=="}}', NULL, TRUE, NULL, '$2a$12$kyq9EF9xG6JQr0Ompb3g1ezDyYJWptuRF4t1mx758BBLhXQeTv/iW', '2026-03-03 12:22:09.695312') RETURNING "id"