app/models/saldo_record.rb

SELECT "saldo_records".* FROM "saldo_records" WHERE "saldo_records"."user_id" = 1 ORDER BY "saldo_records"."created_at" DESC LIMIT 1
---
  def self.latest_for_user(user)
    for_user(user).latest.first