app/controllers/concerns/authentication.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 5 LIMIT 1
---
  def current_user
    return @current_user if defined?(@current_user)

    # Try to find user from session first
    if session[:user_id].present?
      @current_user = User.find_by(id: session[:user_id])