app/jobs/refresh_meal_tickets_job.rb

  def perform(user_id)
    user = User.find(user_id)

    Rails.logger.info "[RefreshMealTicketsJob] Starting refresh for user #{user.id}"

    scraper = GiaeScraperService.new(
      username: user.giae_username,
      password: user.giae_password,
      login_url: Rails.application.config.giae_login_url,
      headless: true
    )

    results = scraper.call

    ActiveRecord::Base.transaction do
      results.each do |result|
        ticket = MealTicket.find_or_initialize_by(
          user_id: user.id,
          date: result[:date]
        )
        ticket.bought = result[:bought]
        ticket.dish_type = result[:dish_type]
        ticket.save!
      end
    end

    user.update!(last_refreshed_at: Time.current)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "meal_tickets".* FROM "meal_tickets" WHERE "meal_tickets"."user_id" = 1 AND "meal_tickets"."date" = '2026-03-02' LIMIT 1
UPDATE "users" SET "last_refreshed_at" = '2026-03-02 17:22:28.015456', "updated_at" = '2026-03-02 17:22:28.038070' WHERE "users"."id" = 1