app/views/layouts/application.html.erb

            <button type="button" class="text-xs sm:text-sm px-2 sm:px-3 py-1 rounded bg-blue-500 text-white hover:bg-blue-600 whitespace-nowrap cursor-pointer touch-manipulation" id="push-btn" data-is-subscribed="<%= current_user.push_subscriptions.any? %>">
              <%= current_user.push_subscriptions.any? ? "Notifications: ON" : "Enable Notifications" %>
---
SELECT 1 AS one FROM "notifications" WHERE "notifications"."user_id" = 1 LIMIT 1